//å›æ–‡æ•°ï¼šæ­£è¯»ä¸åè¯»ç›¸ç­‰çš„æ•°
//2018/11/14 æ›´æ–°
#include <stdio.h> 
int main() {
    int num, NUM;//to do sthÇóÒ»¸öÊıÊÇ·ñÎª»ØÎÄÊı 
    int a[1000], b[1000];//a[n]Îª´ÓÓÒÍù×óÃ¿Î»Êı×Ö¹¹³ÉµÄÊı×é£¬b[n]Îª´Ó×óÍùÓÒÃ¿Î»Êı×Ö¹¹³ÉµÄÊı×é 
    int x=1;//xÎªÊıµÄÎ»Êı 
    scanf ("%d", &num);
    
	NUM=num;
	while (NUM/10==0)
    {
    	NUM=NUM/10;
    	x++;
	}
	
	int i=0, j=0;
	for (i=0; i<x; i++)
	{
		a[i]=num%10;//ÔÚÊı×éaÖĞÂ¼ÈëËüµÄÊı
		num=num/10; 
	}
	
	for (j=0; j<x; j++)
	{
		b[x-j]=a[i];//ÔÚÊı×ébÖĞÂ¼ÈëËüµÄÊı 
	 } 
	 
	if (a[1000]==b[1000])
	{
		printf ("¸ÃÊıÎª»ØÎÄÊı"); 
	}
	else
		printf ("¸ÃÊı²»ÊÇ»ØÎÄÊı");
	
	return 0;
}
